In [1]:
import numpy as np
import pandas as pd
import os

In [2]:
pd.options.display.max_rows = 100

We downloaded data from WHO website morbidity dat (http://ghdx.healthdata.org/gbd-results-tool). For this exercise we are extracting suicide rates from 1985 to 2016

# Extracting suicide data

In [188]:
# get both sex suicide rate
suicide = pd.read_csv('Data/raw_data/IHME-GBD_2016_DATA-a0328ea1-1.csv')

In [189]:
suicide.shape

(11016, 10)

In [190]:
suicide.head()

,measure,location,sex,age,cause,metric,year,val,upper,lower
0,Deaths,Paraguay,Both,All Ages,Self-harm,Rate,1990,3.090264,3.569958,2.503277
1,Deaths,The Bahamas,Both,All Ages,Self-harm,Rate,1990,2.594551,3.099456,2.056983
2,Deaths,Sub-Saharan Africa,Both,All Ages,Self-harm,Rate,1990,6.799710,7.468458,6.063704
3,Deaths,Bermuda,Both,All Ages,Self-harm,Rate,1990,7.009099,8.207439,5.448092
4,Deaths,Belgium,Both,All Ages,Self-harm,Rate,1990,22.653395,27.411047,20.994526

In [191]:
suicide = suicide[['location', 'year', 'val']]

In [192]:
# country data
country = pd.read_excel('Data/raw_data/IHME_GBD_2016_LOCATION_HIERARCHY_Y2018M04D10.XLSX')

In [193]:
country.shape

(374, 6)

In [194]:
country.head()

,location_id,location_name,parent_id,level,sort_order,subnational_location
0,1,Global,1,0,1.0,0
1,44635,High SDI,1,1,2.0,0
2,44634,High-middle SDI,1,1,3.0,0
3,44639,Middle SDI,1,1,4.0,0
4,44636,Low-middle SDI,1,1,5.0,0

In [195]:
# only countries
country = pd.DataFrame({'location': country[country.level == 3]['location_name']})

In [196]:
# filter out for countries
suicide = suicide.merge(country, on='location')

In [197]:
suicide = suicide.rename(columns={'location': 'country', 'val': 'deaths'})

In [198]:
# removing Geogia since country has values duplicated for each year
suicide = suicide[suicide.country != 'Georgia']

In [199]:
suicide.shape

(5211, 3)

In [200]:
suicide.head()

    country  year    deaths
0  Paraguay  1990  3.090264
1  Paraguay  1991  3.236037
2  Paraguay  1992  3.441868
3  Paraguay  1994  3.480025
4  Paraguay  1995  3.568877

In [201]:
# get male data
male_suicide = pd.read_csv('Data/raw_data/IHME-GBD_2016_DATA-0cc86948-1.csv')

In [202]:
male_suicide.head()

,measure,location,sex,age,cause,metric,year,val,upper,lower
0,Deaths,Connecticut,Male,All Ages,Self-harm,Rate,1990,18.970019,26.531676,16.415131
1,Deaths,The Bahamas,Male,All Ages,Self-harm,Rate,1990,4.219567,5.259001,3.184587
2,Deaths,Bulgaria,Male,All Ages,Self-harm,Rate,1990,26.098966,31.542195,21.818262
3,Deaths,Guatemala,Male,All Ages,Self-harm,Rate,1991,11.591724,14.582495,7.568108
4,Deaths,Bermuda,Male,All Ages,Self-harm,Rate,1990,10.718675,13.028930,7.594876

In [203]:
male_suicide = male_suicide[['location', 'year', 'val']]

In [204]:
male_suicide = male_suicide.rename(columns={'location':'country'})

In [205]:
suicide = suicide.merge(male_suicide, how='left', on=['country', 'year'])\
        .rename(columns = {'val':'m_val'})

In [206]:
suicide.head()

    country  year    deaths     m_val
0  Paraguay  1990  3.090264  4.140640
1  Paraguay  1991  3.236037  4.333980
2  Paraguay  1992  3.441868  4.605536
3  Paraguay  1994  3.480025  4.751509
4  Paraguay  1995  3.568877  4.885321

In [207]:
suicide.shape

(5211, 4)

In [208]:
# get female data
female_suicide = pd.read_csv('Data/raw_data/IHME-GBD_2016_DATA-cd6fc99d-1.csv')

In [209]:
female_suicide.head()

,measure,location,sex,age,cause,metric,year,val,upper,lower
0,Deaths,Bulgaria,Female,All Ages,Self-harm,Rate,1990,10.467904,11.287120,9.724681
1,Deaths,Bermuda,Female,All Ages,Self-harm,Rate,1990,3.348141,3.841101,2.883893
2,Deaths,Belgium,Female,All Ages,Self-harm,Rate,1990,13.372433,14.339844,12.414561
3,Deaths,Myanmar,Female,All Ages,Self-harm,Rate,1990,9.393961,14.657273,5.566897
4,Deaths,Philippines,Female,All Ages,Self-harm,Rate,1990,4.170841,4.611486,3.773571

In [210]:
female_suicide = female_suicide[['location', 'year', 'val']]

In [211]:
female_suicide = female_suicide.rename(columns={'location':'country'})

In [212]:
suicide = suicide.merge(female_suicide, how='left', on=['country', 'year'])\
        .rename(columns = {'val':'f_val'})

In [213]:
suicide.head()

    country  year    deaths     m_val     f_val
0  Paraguay  1990  3.090264  4.140640  2.015915
1  Paraguay  1991  3.236037  4.333980  2.112999
2  Paraguay  1992  3.441868  4.605536  2.251465
3  Paraguay  1994  3.480025  4.751509  2.178807
4  Paraguay  1995  3.568877  4.885321  2.221319

In [214]:
suicide.shape

(5211, 5)

In [215]:
# male female ratio
suicide['mf_ratio'] = suicide.m_val/suicide.f_val
suicide = suicide.drop(['m_val', 'f_val'], axis=1)

In [216]:
suicide.head()

    country  year    deaths  mf_ratio
0  Paraguay  1990  3.090264  2.053975
1  Paraguay  1991  3.236037  2.051104
2  Paraguay  1992  3.441868  2.045573
3  Paraguay  1994  3.480025  2.180785
4  Paraguay  1995  3.568877  2.199288

In [217]:
suicide.isnull().any()

country     False
year        False
deaths      False
mf_ratio    False
dtype: bool

# Extracting population data

Population data is extracted from world bank website (https://data.worldbank.org/indicator/SP.POP.TOTL)

In [218]:
# get population data
population = pd.read_csv('Data/raw_data/API_SP.POP.TOTL_DS2_en_csv_v2.csv')

In [219]:
population.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1959,1960,1961,1962,1963,1964,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,Unnamed: 63
0,Aruba,ABW,"Population, total",SP.POP.TOTL,52531.0,54211.0,55438.0,56225.0,56695.0,57032.0,...,101453.0,101669.0,102053.0,102577.0,103187.0,103795.0,104341.0,104822.0,NaN,NaN
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,8834445.0,8996351.0,9166764.0,9345868.0,9533954.0,9731361.0,...,28004331.0,28803167.0,29708599.0,30696958.0,31731688.0,32758020.0,33736494.0,34656032.0,NaN,NaN
2,Angola,AGO,"Population, total",SP.POP.TOTL,5536779.0,5643182.0,5753024.0,5866061.0,5980417.0,6093321.0,...,22549547.0,23369131.0,24218565.0,25096150.0,25998340.0,26920466.0,27859305.0,28813463.0,NaN,NaN
3,Albania,ALB,"Population, total",SP.POP.TOTL,1561012.0,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,...,2927519.0,2913021.0,2905195.0,2900401.0,2895092.0,2889104.0,2880703.0,2876101.0,NaN,NaN
4,Andorra,AND,"Population, total",SP.POP.TOTL,12498.0,13411.0,14375.0,15370.0,16412.0,17469.0,...,84462.0,84449.0,83751.0,82431.0,80788.0,79223.0,78014.0,77281.0,NaN,NaN

In [220]:
population = population.drop(['Indicator Name', 
                 'Indicator Code', 'Unnamed: 63'], axis=1)

In [221]:
population.columns = ['country', 'country_code']+['Y'+str(y) for y in population.columns[2:]]

In [222]:
population.head()

,country,country_code,Y1959,Y1960,Y1961,Y1962,Y1963,Y1964,Y1965,Y1966,...,Y2008,Y2009,Y2010,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017
0,Aruba,ABW,52531.0,54211.0,55438.0,56225.0,56695.0,57032.0,57360.0,57715.0,...,101353.0,101453.0,101669.0,102053.0,102577.0,103187.0,103795.0,104341.0,104822.0,NaN
1,Afghanistan,AFG,8834445.0,8996351.0,9166764.0,9345868.0,9533954.0,9731361.0,9938414.0,10152331.0,...,27294031.0,28004331.0,28803167.0,29708599.0,30696958.0,31731688.0,32758020.0,33736494.0,34656032.0,NaN
2,Angola,AGO,5536779.0,5643182.0,5753024.0,5866061.0,5980417.0,6093321.0,6203299.0,6309770.0,...,21759420.0,22549547.0,23369131.0,24218565.0,25096150.0,25998340.0,26920466.0,27859305.0,28813463.0,NaN
3,Albania,ALB,1561012.0,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,1864791.0,1914573.0,...,2947314.0,2927519.0,2913021.0,2905195.0,2900401.0,2895092.0,2889104.0,2880703.0,2876101.0,NaN
4,Andorra,AND,12498.0,13411.0,14375.0,15370.0,16412.0,17469.0,18549.0,19647.0,...,83861.0,84462.0,84449.0,83751.0,82431.0,80788.0,79223.0,78014.0,77281.0,NaN

In [223]:
population = pd.wide_to_long(population, 'Y', ['country', 'country_code'], 'year').reset_index()\
        .rename(columns = {'Y':'population'})

In [224]:
population.head()

  country country_code  year  population
0   Aruba          ABW  1959     52531.0
1   Aruba          ABW  1960     54211.0
2   Aruba          ABW  1961     55438.0
3   Aruba          ABW  1962     56225.0
4   Aruba          ABW  1963     56695.0

In [225]:
population.year = population.year.astype(int)

In [226]:
population = population[(population.year >= 1990) & (population.year <= 2016)]

In [227]:
population.head()

   country country_code  year  population
31   Aruba          ABW  1990     62149.0
32   Aruba          ABW  1991     64622.0
33   Aruba          ABW  1992     68235.0
34   Aruba          ABW  1993     72504.0
35   Aruba          ABW  1994     76700.0

In [228]:
# merge with population data
change_from = [n for n in suicide.country.unique() if n not in population.country.unique()]

In [229]:
change_to = ['Bahamas, The', 'Korea, Rep.', 'Taiwan', 'Venezuela, RB', 'Macedonia, FYR',
'Slovak Republic', 'Syrian Arab Republic', 'Yemen, Rep.', 'Palestine', 'Kyrgyz Republic',
'Brunei Darussalam', 'Cabo Verde', 'Gambia, The', 'Congo, Dem. Rep.', 
'Korea, Dem. People’s Rep.', 'Virgin Islands (U.S.)', 'Egypt, Arab Rep.', 
'Iran, Islamic Rep.', 'St. Vincent and the Grenadines', 'Congo, Rep.', 
'Lao PDR', 'St. Lucia', 'Micronesia, Fed. Sts.']

In [230]:
# normalize the names
for i in range(len(change_from)):
    suicide.country.replace(change_from[i], change_to[i],inplace=True)

In [237]:
suicide = suicide.merge(population, 'left', on = ['country', 'year'])

In [238]:
suicide.shape

(5211, 6)

In [239]:
suicide.head()

    country  year    deaths  mf_ratio country_code  population
0  Paraguay  1990  3.090264  2.053975          PRY   4213742.0
1  Paraguay  1991  3.236037  2.051104          PRY   4323410.0
2  Paraguay  1992  3.441868  2.045573          PRY   4432736.0
3  Paraguay  1994  3.480025  2.180785          PRY   4651225.0
4  Paraguay  1995  3.568877  2.199288          PRY   4760850.0

In [240]:
suicide.isnull().any()

country         False
year            False
deaths          False
mf_ratio        False
country_code     True
population       True
dtype: bool

# Extracting per_capita income data

Per_capita income data is extracted from world bank website (http://databank.worldbank.org/data/reports.aspx?source=2&series=NY.GDP.MKTP.KD.ZG&country=)

In [242]:
income = pd.read_csv('Data/raw_data/per_capita.csv')

In [244]:
income = income.drop(['Series Name', 'Series Code', 'Country Code'], axis=1)

In [245]:
income.head()

,Country Name,1985 [YR1985],1986 [YR1986],1987 [YR1987],1988 [YR1988],1989 [YR1989],1990 [YR1990],1991 [YR1991],1992 [YR1992],1993 [YR1993],...,2008 [YR2008],2009 [YR2009],2010 [YR2010],2011 [YR2011],2012 [YR2012],2013 [YR2013],2014 [YR2014],2015 [YR2015],2016 [YR2016],2017 [YR2017]
0,Afghanistan,..,..,..,..,..,..,..,..,..,...,373.361116300036,445.893297923744,553.300289383064,603.53702306241,669.009050888028,638.61254321276,629.345250343771,569.577922915754,561.778746269502,..
1,Albania,662.914792567128,719.157295703914,699.384292086697,676.566732520011,723.409610237851,639.463899289892,348.711317786982,218.492165902633,380.527371084275,...,4370.53964653148,4114.13654490945,4094.35883191918,4437.17806843608,4247.61430826246,4413.08169670601,4578.66672753259,3934.89539413158,4124.98239042866,..
2,Algeria,2567.49590456016,2740.65472375228,2790.47391888994,2402.82562714757,2202.55809013399,2394.42038015197,1721.57869577876,1766.05467841426,1797.52356051118,...,4905.25486576261,3868.83123040908,4463.39467488951,5432.41331978116,5565.13452104848,5471.12338878709,5466.42577841535,4160.22006671831,3916.88157088626,..
3,American Samoa,..,..,..,..,..,..,..,..,..,...,9871.99719445906,12058.26382343,10352.8227618312,10375.9942154736,11660.329531052,11589.8530023324,11598.7517362051,11865.9632317194,11834.7452292307,..
4,Andorra,7774.39382903478,10361.8159820255,12616.167565929,14304.3569645785,15166.437850754,18878.5059692988,19532.5401504525,20547.7117897897,16516.4710272204,...,47785.6590856793,43339.3798746543,39736.3540626699,41098.7669417228,38391.0808669785,40619.7112977795,42294.9947269717,36038.2676044596,36988.6220301891,..

In [246]:
income.columns = ['Country Name']+['per_capita'+str(v) for v in np.arange(1985, 2018)]

In [248]:
income.shape

(269, 34)

In [249]:
# remove NaN columns at the end
income = income.dropna()

In [251]:
income.shape

(264, 34)

In [252]:
income = pd.wide_to_long(income, 'per_capita', 'Country Name', 'Year').reset_index()

In [253]:
income = income.replace('..', np.NaN)

In [258]:
income = income.rename(columns={'Country Name': 'country', 'Year' : 'year'})

In [270]:
income.year = income.year.astype(int)
income.per_capita = income.per_capita.astype(float)

In [271]:
income.head()

          country  year   per_capita
0     Afghanistan  1985          NaN
1         Albania  1985   662.914793
2         Algeria  1985  2567.495905
3  American Samoa  1985          NaN
4         Andorra  1985  7774.393829

In [272]:
income.shape

(8712, 3)

In [274]:
# merging with income data
suicide = suicide.merge(income, 'left', ['country', 'year'])

In [275]:
suicide.shape

(5211, 7)

In [278]:
suicide.head()

    country  year    deaths  mf_ratio country_code  population   per_capita
0  Paraguay  1990  3.090264  2.053975          PRY   4213742.0  1351.578137
1  Paraguay  1991  3.236037  2.051104          PRY   4323410.0  1615.476618
2  Paraguay  1992  3.441868  2.045573          PRY   4432736.0  1614.674104
3  Paraguay  1994  3.480025  2.180785          PRY   4651225.0  1692.238533
4  Paraguay  1995  3.568877  2.199288          PRY   4760850.0  1903.469193

In [277]:
suicide.isnull().any()

country         False
year            False
deaths          False
mf_ratio        False
country_code     True
population       True
per_capita       True
dtype: bool

## Get temperature data

In [284]:
t_files = os.listdir('Data/raw_data/temp/')

In [286]:
t_dfs = []
for f in t_files:
    t_dfs.append(pd.read_excel('Data/raw_data/temp/'+f))

In [312]:
temperature = pd.concat(t_dfs)

In [313]:
temperature.columns

Index(['tas', '\tYear', ' Month', ' Country', ' ISO3', ' ISO2'], dtype='object')

In [314]:
temperature = temperature.drop([' ISO3', ' ISO2'], axis=1).\
    rename(columns = {'\tYear':'year', ' Country':'country_code'})

In [315]:
temperature.shape

(57000, 4)

In [316]:
temperature.head()

       tas  year   Month country_code
0  23.1112  1991       1          TZA
1  23.6897  1991       2          TZA
2  23.7830  1991       3          TZA
3  23.0193  1991       4          TZA
4  22.3202  1991       5          TZA

In [318]:
# get average yearly temperature
temperature = temperature.groupby(['country_code', 'year'])['tas'].mean().reset_index().\
    rename(columns = {'tas':'temperature'})

In [319]:
temperature.shape

(4750, 3)

In [320]:
temperature.head()

  country_code  year  temperature
0          AFG  1991    13.118033
1          AFG  1992    12.655889
2          AFG  1993    12.905315
3          AFG  1994    13.142707
4          AFG  1995    13.124963

In [322]:
suicide = suicide.merge(temperature, 'left', ['country_code', 'year'])

In [323]:
suicide.head()

,country,year,deaths,mf_ratio,country_code,population,per_capita,temperature
0,Paraguay,1990,3.090264,2.053975,PRY,4213742.0,1351.578137,NaN
1,Paraguay,1991,3.236037,2.051104,PRY,4323410.0,1615.476618,23.646150
2,Paraguay,1992,3.441868,2.045573,PRY,4432736.0,1614.674104,22.790292
3,Paraguay,1994,3.480025,2.180785,PRY,4651225.0,1692.238533,24.120992
4,Paraguay,1995,3.568877,2.199288,PRY,4760850.0,1903.469193,23.614717

In [324]:
suicide.shape

(5211, 8)

# Get percentage of students enrolling secondary education

This data is exracted from the world bank data repository http://databank.worldbank.org/data/reports.aspx?source=world-development-indicators&Type=TABLE&preview=on#

In [4]:
secondary = pd.read_csv('Data/raw_data/secondary_education.csv')

In [5]:
secondary.shape

(269, 32)

In [6]:
secondary.head()

,Country Name,Country Code,Series Name,Series Code,1990 [YR1990],1991 [YR1991],1992 [YR1992],1993 [YR1993],1994 [YR1994],1995 [YR1995],...,2008 [YR2008],2009 [YR2009],2010 [YR2010],2011 [YR2011],2012 [YR2012],2013 [YR2013],2014 [YR2014],2015 [YR2015],2016 [YR2016],2017 [YR2017]
0,Argentina,ARG,"School enrollment, secondary (% gross)",SE.SEC.ENRR,71.1518325805664,71.6378936767578,..,..,68.7304763793945,..,...,95.248176574707,98.8311767578125,101.800773620605,103.603286743164,105.196243286133,106.324806213379,106.778343200684,107.07502746582,..,..
1,Australia,AUS,"School enrollment, secondary (% gross)",SE.SEC.ENRR,..,..,..,133.714279174805,131.992706298828,142.569519042969,...,..,..,..,..,..,..,..,158.147186279297,153.848266601563,..
2,Brazil,BRA,"School enrollment, secondary (% gross)",SE.SEC.ENRR,..,..,..,..,..,..,...,96.7201232910156,96.6654815673828,..,95.2633819580078,95.5837326049805,101.868072509766,101.950897216797,99.6509704589844,..,..
3,China,CHN,"School enrollment, secondary (% gross)",SE.SEC.ENRR,37.4352111816406,39.693489074707,42.7265014648438,45.4694404602051,46.9014892578125,50.4073791503906,...,79.8158798217773,84.0127487182617,88.0304412841797,91.0833435058594,92.5681304931641,95.0299530029297,..,..,..,..
4,France,FRA,"School enrollment, secondary (% gross)",SE.SEC.ENRR,96.6559600830078,101.195777893066,104.901252746582,105.505592346191,113.829856872559,113.907012939453,...,113.004669189453,112.355903625488,112.396942138672,112.278358459473,112.308311462402,111.430679321289,111.243690490723,111.067039489746,..,..

In [8]:
secondary = secondary.drop(['Series Name', 'Series Code', 'Country Name', 
                           '2017 [YR2017]'], axis=1)

In [9]:
secondary.head()

,Country Code,1990 [YR1990],1991 [YR1991],1992 [YR1992],1993 [YR1993],1994 [YR1994],1995 [YR1995],1996 [YR1996],1997 [YR1997],1998 [YR1998],...,2007 [YR2007],2008 [YR2008],2009 [YR2009],2010 [YR2010],2011 [YR2011],2012 [YR2012],2013 [YR2013],2014 [YR2014],2015 [YR2015],2016 [YR2016]
0,ARG,71.1518325805664,71.6378936767578,..,..,68.7304763793945,..,78.3769302368164,75.1688079833984,81.4302825927734,...,93.7097015380859,95.248176574707,98.8311767578125,101.800773620605,103.603286743164,105.196243286133,106.324806213379,106.778343200684,107.07502746582,..
1,AUS,..,..,..,133.714279174805,131.992706298828,142.569519042969,147.948013305664,152.246307373047,..,...,..,..,..,..,..,..,..,..,158.147186279297,153.848266601563
2,BRA,..,..,..,..,..,..,..,..,..,...,95.1699981689453,96.7201232910156,96.6654815673828,..,95.2633819580078,95.5837326049805,101.868072509766,101.950897216797,99.6509704589844,..
3,CHN,37.4352111816406,39.693489074707,42.7265014648438,45.4694404602051,46.9014892578125,50.4073791503906,54.5773010253906,56.9693984985352,..,...,75.0220794677734,79.8158798217773,84.0127487182617,88.0304412841797,91.0833435058594,92.5681304931641,95.0299530029297,..,..,..
4,FRA,96.6559600830078,101.195777893066,104.901252746582,105.505592346191,113.829856872559,113.907012939453,112.434349060059,111.233757019043,110.22078704834,...,113.48014831543,113.004669189453,112.355903625488,112.396942138672,112.278358459473,112.308311462402,111.430679321289,111.243690490723,111.067039489746,..

In [10]:
secondary.columns = ['Country Code']+['enrollment'+str(v) for v in np.arange(1990, 2017)]

In [12]:
# remove NaN columns at the end
secondary = secondary.dropna()

In [13]:
secondary = pd.wide_to_long(secondary, 'enrollment', 'Country Code', 'Year').reset_index()

In [14]:
secondary.head()

  Country Code  Year        enrollment
0          ARG  1990  71.1518325805664
1          AUS  1990                ..
2          BRA  1990                ..
3          CHN  1990  37.4352111816406
4          FRA  1990  96.6559600830078

In [15]:
secondary = secondary.replace('..', np.NaN)

In [16]:
secondary = secondary.rename(columns={'Country Code': 'country_code', 'Year' : 'year'})

In [18]:
secondary.year = secondary.year.astype(int)
secondary.enrollment = secondary.enrollment.astype(float)

In [19]:
secondary.head()

  country_code  year  enrollment
0          ARG  1990   71.151833
1          AUS  1990         NaN
2          BRA  1990         NaN
3          CHN  1990   37.435211
4          FRA  1990   96.655960

In [21]:
# merging with enrollment data
suicide = suicide.merge(secondary, 'left', ['country_code', 'year'])

In [22]:
suicide.head()

,country,year,deaths,mf_ratio,country_code,population,per_capita,temperature,enrollment
0,Paraguay,1990,3.090264,2.053975,PRY,4213742.0,1351.578137,NaN,31.009640
1,Paraguay,1991,3.236037,2.051104,PRY,4323410.0,1615.476618,23.646150,31.109859
2,Paraguay,1992,3.441868,2.045573,PRY,4432736.0,1614.674104,22.790292,34.308071
3,Paraguay,1994,3.480025,2.180785,PRY,4651225.0,1692.238533,24.120992,38.555759
4,Paraguay,1995,3.568877,2.199288,PRY,4760850.0,1903.469193,23.614717,41.358780

In [23]:
suicide.shape

(5211, 9)

In [24]:
suicide.to_csv('suicide.csv', index=False)